{
  "class_name": "Sequential",
  "config": {
    "name": "sequential_1",
    "layers": [{
      "class_name": "Conv3D",
      "config": {
        "use_bias": true,
        "bias_regularizer": null,
        "activation": "relu",
        "data_format": "channels_last",
        "name": "conv1",
        "dtype": "float32",
        "batch_input_shape": [null, 16, 112, 112, 3],
        "kernel_size": [3, 3, 3],
        "bias_constraint": null,
        "trainable": true,
        "dilation_rate": [1, 1, 1],
        "kernel_initializer": {
          "class_name": "VarianceScaling",
          "config": {
            "scale": 1.0,
            "mode": "fan_avg",
            "seed": null,
            "distribution": "uniform"
          }
        },
        "bias_initializer": {
          "class_name": "Zeros",
          "config": {}
        },
        "filters": 64,
        "padding": "same",
        "strides": [1, 1, 1],
        "kernel_constraint": null,
        "activity_regularizer": null,
        "kernel_regularizer": null
      }
    }, {
      "class_name": "MaxPooling3D",
      "config": {
        "strides": [1, 2, 2],
        "trainable": true,
        "pool_size": [1, 2, 2],
        "data_format": "channels_last",
        "padding": "valid",
        "name": "pool1"
      }
    }, {
      "class_name": "Conv3D",
      "config": {
        "strides": [1, 1, 1],
        "bias_regularizer": null,
        "activation": "relu",
        "bias_initializer": {
          "class_name": "Zeros",
          "config": {}
        },
        "name": "conv2",
        "kernel_size": [3, 3, 3],
        "bias_constraint": null,
        "trainable": true,
        "dilation_rate": [1, 1, 1],
        "kernel_initializer": {
          "class_name": "VarianceScaling",
          "config": {
            "scale": 1.0,
            "mode": "fan_avg",
            "seed": null,
            "distribution": "uniform"
          }
        },
        "data_format": "channels_last",
        "filters": 128,
        "padding": "same",
        "use_bias": true,
        "kernel_constraint": null,
        "activity_regularizer": null,
        "kernel_regularizer": null
      }
    }, {
      "class_name": "MaxPooling3D",
      "config": {
        "strides": [2, 2, 2],
        "trainable": true,
        "pool_size": [2, 2, 2],
        "data_format": "channels_last",
        "padding": "valid",
        "name": "pool2"
      }
    }, {
      "class_name": "Conv3D",
      "config": {
        "strides": [1, 1, 1],
        "bias_regularizer": null,
        "activation": "relu",
        "bias_initializer": {
          "class_name": "Zeros",
          "config": {}
        },
        "name": "conv3a",
        "kernel_size": [3, 3, 3],
        "bias_constraint": null,
        "trainable": true,
        "dilation_rate": [1, 1, 1],
        "kernel_initializer": {
          "class_name": "VarianceScaling",
          "config": {
            "scale": 1.0,
            "mode": "fan_avg",
            "seed": null,
            "distribution": "uniform"
          }
        },
        "data_format": "channels_last",
        "filters": 256,
        "padding": "same",
        "use_bias": true,
        "kernel_constraint": null,
        "activity_regularizer": null,
        "kernel_regularizer": null
      }
    }, {
      "class_name": "Conv3D",
      "config": {
        "strides": [1, 1, 1],
        "bias_regularizer": null,
        "activation": "relu",
        "bias_initializer": {
          "class_name": "Zeros",
          "config": {}
        },
        "name": "conv3b",
        "kernel_size": [3, 3, 3],
        "bias_constraint": null,
        "trainable": true,
        "dilation_rate": [1, 1, 1],
        "kernel_initializer": {
          "class_name": "VarianceScaling",
          "config": {
            "scale": 1.0,
            "mode": "fan_avg",
            "seed": null,
            "distribution": "uniform"
          }
        },
        "data_format": "channels_last",
        "filters": 256,
        "padding": "same",
        "use_bias": true,
        "kernel_constraint": null,
        "activity_regularizer": null,
        "kernel_regularizer": null
      }
    }, {
      "class_name": "MaxPooling3D",
      "config": {
        "strides": [2, 2, 2],
        "trainable": true,
        "pool_size": [2, 2, 2],
        "data_format": "channels_last",
        "padding": "valid",
        "name": "pool3"
      }
    }, {
      "class_name": "Conv3D",
      "config": {
        "strides": [1, 1, 1],
        "bias_regularizer": null,
        "activation": "relu",
        "bias_initializer": {
          "class_name": "Zeros",
          "config": {}
        },
        "name": "conv4a",
        "kernel_size": [3, 3, 3],
        "bias_constraint": null,
        "trainable": true,
        "dilation_rate": [1, 1, 1],
        "kernel_initializer": {
          "class_name": "VarianceScaling",
          "config": {
            "scale": 1.0,
            "mode": "fan_avg",
            "seed": null,
            "distribution": "uniform"
          }
        },
        "data_format": "channels_last",
        "filters": 512,
        "padding": "same",
        "use_bias": true,
        "kernel_constraint": null,
        "activity_regularizer": null,
        "kernel_regularizer": null
      }
    }, {
      "class_name": "Conv3D",
      "config": {
        "strides": [1, 1, 1],
        "bias_regularizer": null,
        "activation": "relu",
        "bias_initializer": {
          "class_name": "Zeros",
          "config": {}
        },
        "name": "conv4b",
        "kernel_size": [3, 3, 3],
        "bias_constraint": null,
        "trainable": true,
        "dilation_rate": [1, 1, 1],
        "kernel_initializer": {
          "class_name": "VarianceScaling",
          "config": {
            "scale": 1.0,
            "mode": "fan_avg",
            "seed": null,
            "distribution": "uniform"
          }
        },
        "data_format": "channels_last",
        "filters": 512,
        "padding": "same",
        "use_bias": true,
        "kernel_constraint": null,
        "activity_regularizer": null,
        "kernel_regularizer": null
      }
    }, {
      "class_name": "MaxPooling3D",
      "config": {
        "strides": [2, 2, 2],
        "trainable": true,
        "pool_size": [2, 2, 2],
        "data_format": "channels_last",
        "padding": "valid",
        "name": "pool4"
      }
    }, {
      "class_name": "Conv3D",
      "config": {
        "strides": [1, 1, 1],
        "bias_regularizer": null,
        "activation": "relu",
        "bias_initializer": {
          "class_name": "Zeros",
          "config": {}
        },
        "name": "conv5a",
        "kernel_size": [3, 3, 3],
        "bias_constraint": null,
        "trainable": true,
        "dilation_rate": [1, 1, 1],
        "kernel_initializer": {
          "class_name": "VarianceScaling",
          "config": {
            "scale": 1.0,
            "mode": "fan_avg",
            "seed": null,
            "distribution": "uniform"
          }
        },
        "data_format": "channels_last",
        "filters": 512,
        "padding": "same",
        "use_bias": true,
        "kernel_constraint": null,
        "activity_regularizer": null,
        "kernel_regularizer": null
      }
    }, {
      "class_name": "Conv3D",
      "config": {
        "strides": [1, 1, 1],
        "bias_regularizer": null,
        "activation": "relu",
        "bias_initializer": {
          "class_name": "Zeros",
          "config": {}
        },
        "name": "conv5b",
        "kernel_size": [3, 3, 3],
        "bias_constraint": null,
        "trainable": true,
        "dilation_rate": [1, 1, 1],
        "kernel_initializer": {
          "class_name": "VarianceScaling",
          "config": {
            "scale": 1.0,
            "mode": "fan_avg",
            "seed": null,
            "distribution": "uniform"
          }
        },
        "data_format": "channels_last",
        "filters": 512,
        "padding": "same",
        "use_bias": true,
        "kernel_constraint": null,
        "activity_regularizer": null,
        "kernel_regularizer": null
      }
    }, {
      "class_name": "ZeroPadding3D",
      "config": {
        "data_format": "channels_last",
        "padding": [
          [0, 0],
          [0, 1],
          [0, 1]
        ],
        "name": "zeropad5",
        "trainable": true
      }
    }, {
      "class_name": "MaxPooling3D",
      "config": {
        "strides": [2, 2, 2],
        "trainable": true,
        "pool_size": [2, 2, 2],
        "data_format": "channels_last",
        "padding": "valid",
        "name": "pool5"
      }
    }, {
      "class_name": "Flatten",
      "config": {
        "data_format": "channels_last",
        "name": "flatten_1",
        "trainable": true
      }
    }, {
      "class_name": "Dense",
      "config": {
        "use_bias": true,
        "bias_regularizer": null,
        "bias_initializer": {
          "class_name": "Zeros",
          "config": {}
        },
        "activation": "relu",
        "bias_constraint": null,
        "trainable": true,
        "kernel_regularizer": null,
        "kernel_initializer": {
          "class_name": "VarianceScaling",
          "config": {
            "scale": 1.0,
            "mode": "fan_avg",
            "seed": null,
            "distribution": "uniform"
          }
        },
        "name": "fc6",
        "kernel_constraint": null,
        "units": 4096,
        "activity_regularizer": null
      }
    }, {
      "class_name": "Dropout",
      "config": {
        "trainable": true,
        "noise_shape": null,
        "name": "dropout_1",
        "seed": null,
        "rate": 0.5
      }
    }, {
      "class_name": "Dense",
      "config": {
        "use_bias": true,
        "bias_regularizer": null,
        "bias_initializer": {
          "class_name": "Zeros",
          "config": {}
        },
        "activation": "relu",
        "bias_constraint": null,
        "trainable": true,
        "kernel_regularizer": null,
        "kernel_initializer": {
          "class_name": "VarianceScaling",
          "config": {
            "scale": 1.0,
            "mode": "fan_avg",
            "seed": null,
            "distribution": "uniform"
          }
        },
        "name": "fc7",
        "kernel_constraint": null,
        "units": 4096,
        "activity_regularizer": null
      }
    }, {
      "class_name": "Dropout",
      "config": {
        "trainable": true,
        "noise_shape": null,
        "name": "dropout_2",
        "seed": null,
        "rate": 0.5
      }
    }, {
      "class_name": "Dense",
      "config": {
        "use_bias": true,
        "bias_regularizer": null,
        "bias_initializer": {
          "class_name": "Zeros",
          "config": {}
        },
        "activation": "softmax",
        "bias_constraint": null,
        "trainable": true,
        "kernel_regularizer": null,
        "kernel_initializer": {
          "class_name": "VarianceScaling",
          "config": {
            "scale": 1.0,
            "mode": "fan_avg",
            "seed": null,
            "distribution": "uniform"
          }
        },
        "name": "fc8",
        "kernel_constraint": null,
        "units": 487,
        "activity_regularizer": null
      }
    }]
  },
  "backend": "tensorflow",
  "keras_version": "2.2.4"
}
